* Start of life

- I bought the machine from the computer store on Dec 2, 2014
- It came with a SSD 256 Gigabytes
- Got 3 year warranty


* Disable the trackpad.. except for push buttons
#+BEGIN_SRC bash :results output
synclient TouchpadOff=1
#+END_SRC

#+RESULTS:


* These settings seem to work


#+BEGIN_SRC bash :results output
synclient ClickFinger3=0
synclient ClickFinger2=0
synclient VertScrollDelta=-200
synclient HorizScrollDelta=200
synclient PalmMinWidth=4
synclient PalmMinZ=50
synclient LeftEdge=3000
synclient RightEdge=7000
synclient TopEdge=3000
#+END_SRC

#+RESULTS:



Original


#+BEGIN_SRC shell :results output
synclient -l
#+END_SRC

#+RESULTS:
#+begin_example
Parameter settings:
    LeftEdge                = 3000
    RightEdge               = 5397
    TopEdge                 = 3000
    BottomEdge              = 4449
    FingerLow               = 25
    FingerHigh              = 30
    MaxTapTime              = 180
    MaxTapMove              = 251
    MaxDoubleTapTime        = 180
    SingleTapTimeout        = 180
    ClickTime               = 100
    EmulateMidButtonTime    = 0
    EmulateTwoFingerMinZ    = 282
    EmulateTwoFingerMinW    = 7
    VertScrollDelta         = -200
    HorizScrollDelta        = 200
    VertEdgeScroll          = 0
    HorizEdgeScroll         = 0
    CornerCoasting          = 0
    VertTwoFingerScroll     = 1
    HorizTwoFingerScroll    = 1
    MinSpeed                = 1
    MaxSpeed                = 1.75
    AccelFactor             = 0.0350385
    TouchpadOff             = 0
    LockedDrags             = 0
    LockedDragTimeout       = 5000
    RTCornerButton          = 2
    RBCornerButton          = 3
    LTCornerButton          = 0
    LBCornerButton          = 0
    TapButton1              = 1
    TapButton2              = 3
    TapButton3              = 2
    ClickFinger1            = 1
    ClickFinger2            = 0
    ClickFinger3            = 0
    CircularScrolling       = 0
    CircScrollDelta         = 0.1
    CircScrollTrigger       = 0
    CircularPad             = 0
    PalmDetect              = 1
    PalmMinWidth            = 4
    PalmMinZ                = 50
    CoastingSpeed           = 20
    CoastingFriction        = 50
    PressureMotionMinZ      = 30
    PressureMotionMaxZ      = 160
    PressureMotionMinFactor = 1
    PressureMotionMaxFactor = 1
    ResolutionDetect        = 1
    GrabEventDevice         = 0
    TapAndDragGesture       = 1
    AreaLeftEdge            = 0
    AreaRightEdge           = 0
    AreaTopEdge             = 0
    AreaBottomEdge          = 0
    HorizHysteresis         = 28
    VertHysteresis          = 28
    ClickPad                = 1
    RightButtonAreaLeft     = 3471
    RightButtonAreaRight    = 0
    RightButtonAreaTop      = 4058
    RightButtonAreaBottom   = 0
    MiddleButtonAreaLeft    = 0
    MiddleButtonAreaRight   = 0
    MiddleButtonAreaTop     = 0
    MiddleButtonAreaBottom  = 0
#+end_example

Default values

#+begin_example
Parameter settings:
    LeftEdge                = 1545
    RightEdge               = 5397
    TopEdge                 = 1403
    BottomEdge              = 4449
    FingerLow               = 25
    FingerHigh              = 30
    MaxTapTime              = 180
    MaxTapMove              = 251
    MaxDoubleTapTime        = 180
    SingleTapTimeout        = 180
    ClickTime               = 100
    EmulateMidButtonTime    = 0
    EmulateTwoFingerMinZ    = 282
    EmulateTwoFingerMinW    = 7
    VertScrollDelta         = -100
    HorizScrollDelta        = 114
    VertEdgeScroll          = 0
    HorizEdgeScroll         = 0
    CornerCoasting          = 0
    VertTwoFingerScroll     = 1
    HorizTwoFingerScroll    = 1
    MinSpeed                = 1
    MaxSpeed                = 1.75
    AccelFactor             = 0.0350385
    TouchpadOff             = 0
    LockedDrags             = 0
    LockedDragTimeout       = 5000
    RTCornerButton          = 2
    RBCornerButton          = 3
    LTCornerButton          = 0
    LBCornerButton          = 0
    TapButton1              = 1
    TapButton2              = 3
    TapButton3              = 2
    ClickFinger1            = 1
    ClickFinger2            = 2
    ClickFinger3            = 3
    CircularScrolling       = 0
    CircScrollDelta         = 0.1
    CircScrollTrigger       = 0
    CircularPad             = 0
    PalmDetect              = 1
    PalmMinWidth            = 4
    PalmMinZ                = 50
    CoastingSpeed           = 20
    CoastingFriction        = 50
    PressureMotionMinZ      = 30
    PressureMotionMaxZ      = 160
    PressureMotionMinFactor = 1
    PressureMotionMaxFactor = 1
    ResolutionDetect        = 1
    GrabEventDevice         = 0
    TapAndDragGesture       = 1
    AreaLeftEdge            = 0
    AreaRightEdge           = 0
    AreaTopEdge             = 0
    AreaBottomEdge          = 0
    HorizHysteresis         = 28
    VertHysteresis          = 28
    ClickPad                = 1
    RightButtonAreaLeft     = 3471
    RightButtonAreaRight    = 0
    RightButtonAreaTop      = 4058
    RightButtonAreaBottom   = 0
    MiddleButtonAreaLeft    = 0
    MiddleButtonAreaRight   = 0
    MiddleButtonAreaTop     = 0
    MiddleButtonAreaBottom  = 0
#+end_example

#+BEGIN_SRC shell :results output
TOUCHPAD="SynPS/2 Synaptics TouchPad"
TRACKPOINT="TPPS/2 IBM TrackPoint"
echo "doing it"
xinput set-prop "${TOUCHPAD}" "Synaptics Palm Detection" 1
xinput set-prop "${TOUCHPAD}" "Synaptics Off" 0
exit
echo "setting right area of pad to rightclick. Order:  RightButtonAreaLeft, RightButtonAreaRight, RightButtonAreaTop, RightButtonAreaBottom, MiddleButtonAreaLeft, 
MiddleButtonAreaRight, MitddleButtonAreaTop, MiddleButtonAreaBottom"
xinput set-prop "${TOUCHPAD}" "Synaptics Soft Button Areas" 4000, 0, 0, 0, 3000, 3999, 0, 0
echo "enable twofingerscrolling in both directions"
xinput set-prop "${TOUCHPAD}" "Synaptics Two-Finger Scrolling" 1, 1
echo "shortening upper edge to reserve space for 'just button' actions. Order: left, right, top, bottom"
xinput set-prop "${TOUCHPAD}" "Synaptics Area" 0, 0, 5000, 0
echo "enabling palm detection"
echo "Middle mouse button emulation for scrolling on trackpoint"
xinput set-prop "${TRACKPOINT}" "Evdev Wheel Emulation" 1
xinput set-prop "${TRACKPOINT}" "Evdev Wheel Emulation Button" 2
xinput set-prop "${TRACKPOINT}" "Evdev Wheel Emulation Timeout" 200
xinput set-prop "${TRACKPOINT}" "Evdev Wheel Emulation Axes" 6 7 4 5 # horizontal und vertikal
echo "enable tap events"
xinput set-prop "${TOUCHPAD}" "Synaptics Tap Action" 2, 3, 1, 1, 1, 3, 0
echo "touchpad on"
#+END_SRC

#+RESULTS:
#+begin_example
doing it
#+end_example

#+BEGIN_SRC bash :results output
xinput list-props 'SynPS/2 Synaptics TouchPad'
#+END_SRC

#+RESULTS:
#+begin_example
Device 'SynPS/2 Synaptics TouchPad':
	Device Enabled (136):	1
	Coordinate Transformation Matrix (138):	1.000000, 0.000000, 0.000000, 0.000000, 1.000000, 0.000000, 0.000000, 0.000000, 1.000000
	Device Accel Profile (265):	1
	Device Accel Constant Deceleration (266):	2.500000
	Device Accel Adaptive Deceleration (267):	1.000000
	Device Accel Velocity Scaling (268):	12.500000
	Synaptics Edges (323):	1545, 5397, 1403, 4449
	Synaptics Finger (324):	25, 30, 0
	Synaptics Tap Time (325):	180
	Synaptics Tap Move (326):	251
	Synaptics Tap Durations (327):	180, 180, 100
	Synaptics ClickPad (328):	1
	Synaptics Middle Button Timeout (329):	0
	Synaptics Two-Finger Pressure (330):	282
	Synaptics Two-Finger Width (331):	7
	Synaptics Scrolling Distance (332):	-100, 114
	Synaptics Edge Scrolling (333):	0, 0, 0
	Synaptics Two-Finger Scrolling (334):	1, 1
	Synaptics Move Speed (335):	1.000000, 1.750000, 0.035039, 0.000000
	Synaptics Off (336):	0
	Synaptics Locked Drags (337):	0
	Synaptics Locked Drags Timeout (338):	5000
	Synaptics Tap Action (339):	2, 3, 0, 0, 1, 3, 2
	Synaptics Click Action (340):	1, 2, 3
	Synaptics Circular Scrolling (341):	0
	Synaptics Circular Scrolling Distance (342):	0.100000
	Synaptics Circular Scrolling Trigger (343):	0
	Synaptics Circular Pad (344):	0
	Synaptics Palm Detection (345):	1
	Synaptics Palm Dimensions (346):	4, 50
	Synaptics Coasting Speed (347):	20.000000, 50.000000
	Synaptics Pressure Motion (348):	30, 160
	Synaptics Pressure Motion Factor (349):	1.000000, 1.000000
	Synaptics Resolution Detect (350):	1
	Synaptics Grab Event Device (351):	0
	Synaptics Gestures (352):	1
	Synaptics Capabilities (353):	1, 0, 0, 1, 1, 1, 1
	Synaptics Pad Resolution (354):	55, 53
	Synaptics Area (355):	0, 0, 0, 0
	Synaptics Soft Button Areas (356):	3471, 0, 4058, 0, 0, 0, 0, 0
	Synaptics Secondary Soft Button Areas (357):	3829, 0, 0, 1687, 3112, 3829, 0, 1687
	Synaptics Noise Cancellation (358):	28, 28
	Device Product ID (254):	2, 7
	Device Node (255):	"/dev/input/event4"
#+end_example

